---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IntegerParameterValue Constructor
IntegerParameterValue Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | IntegerParameterValue()()()() | Default constructor |
|  | IntegerParameterValue(Int32) | Value constructor |

# See Also

IntegerParameterValue Class

IntegerParameterValue Members

Autodesk.Revit.DB Namespace